cases/chpt6-proxyBlade-root/constant/arcProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		arcProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// travel speed
arc_vel			arc_vel			[0 1 -1 0 0 0 0] (10e-3 0 0);

// Initial location
arc_pos0		arc_pos0		[0 1 0 0 0 0 0] (0 0 0.01);		

// time of switch on
arc_start_t		arc_start_t		[0 0 1 0 0 0 0] 1000;

// radius
arc_radius		arc_radius		[0 1 0 0 0 0 0] 1.5e-2;
	
// efficiency
arc_eff			arc_eff			[0 0 0 0 0 0 0] 0;

// arc power
arc_power		arc_power		[1 2 -3 0 0 0 0] 0;
