cases/chpt6-proxyBlade-root/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.Phase1 0
    volScalarFieldValue alpha.Phase2 0
    volScalarFieldValue alpha.Phase3 1
);

regions
(
    boxToCell
    {
        box (-10 -10 0.04) (10 10 0.05);
        fieldValues
        (
            volScalarFieldValue alpha.Phase1 1
            volScalarFieldValue alpha.Phase2 0
            volScalarFieldValue alpha.Phase3 0
        );
    }
);


// ************************************************************************* //
